{
  "latest_version": "2.3.0",
  "version_code": 5,
  "apk_url": "https://worldmates.club/sources-app/worldmates-latest.apk",
  "changelog": [
    "Каналы: полностью переработан внешний вид вкладки «Каналы» — убран старый громоздкий layout с жёлтыми карточками и золотыми звёздами, теперь список каналов выглядит аккуратно и единообразно с обычными чатами (чистый список в стиле Telegram)",
    "Сторис каналов: реализована полноценная система сторис для каналов — администраторы каналов теперь могут публиковать сторис (фото/видео) для рекламы и контента. Создан отдельный PHP API (channel_stories.php), Android модели, репозиторий, ViewModel. В UI добавлена строка сторис каналов с аватарами-кругами и кнопкой создания. Личные сторис отображаются только в «Чатах», канальные — только в «Каналах»",
    "Разделение сторис: личные сторис и канальные сторис теперь полностью разделены между вкладками",
    "История звонков: новый полноценный экран «Дзвінки» в боковом меню — отображаются все входящие, исходящие, пропущенные и групповые звонки с фильтрацией, группировкой по датам, свайпом для удаления и пагинацией. Создан PHP API (call_history.php) с автомиграцией таблиц wo_calls",
    "Улучшенный UI звонков: новая панель управления с glassmorphism эффектом, улучшенный индикатор состояния соединения с анимациями, баннеры записи и демонстрации экрана, индикатор шумоподавления",
    "Демонстрация экрана: реализован ScreenSharingManager на базе MediaProjection API — можно делиться экраном во время звонка через WebRTC renegotiation",
    "Запись звонков: реализован CallRecordingManager — запись аудио звонка в файл M4A с сохранением в MediaStore, уведомление всех участников о записи через Socket.IO",
    "Picture-in-Picture: автоматический переход в PiP режим при нажатии кнопки Home во время видеозвонка, корректное соотношение сторон 9:16",
    "Шумоподавление: переключатель в панели управления звонком с уведомлением участников",
    "Групповые звонки (UI): адаптивная сетка участников (от 1 до 20), плитки с видео/аватаром, индикатор говорящего, статус микрофона",
    "Node.js: добавлены события call:screen_share, call:recording, call:noise_cancellation для сигнализации между участниками"
  ],
  "is_mandatory": false,
  "published_at": "2026-02-08T12:00:00Z"
}
